In [24]:
import pandas as pd

# groupby is collapsing rows based off column
# using some kind of aggregate data

# many vals -> 1 val


data = {
    'Company': 'GOOG GOOG MSFT MSFT FB FB'.split(),
    'Person': 'Sam Charlie Amy Vanessa Carl Sarah'.split(),
    'Sales': [200, 120, 340, 124, 243, 350]
}

df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [25]:
# group by the company name
bycomp = df.groupby('Company')
bycomp.mean(numeric_only=True)

# NOTE: course doesnt mention this but need to specify numeric only now!

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [27]:
bycomp.sum(numeric_only=True).loc['FB']

Sales    593
Name: FB, dtype: int64

In [29]:
# very useful: .describe
# gives hella info on the table

bycomp.describe().transpose()

# transpose for company to be a column

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000